
## Plan Result (aws/main)

[CI link](https://github.com/grimoh/infrastructure/actions/runs/5186229330)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_kms_alias.tf_confidential
  * aws_kms_key.tf_confidential
  * aws_kms_key_policy.tf_confidential


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_kms_alias.tf_confidential will be created
  + resource "aws_kms_alias" "tf_confidential" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/aws-main-tf-confidential"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.tf_confidential will be created
  + resource "aws_kms_key" "tf_confidential" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for handling confidential information in infrastructure/aws/main"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_kms_key_policy.tf_confidential will be created
  + resource "aws_kms_key_policy" "tf_confidential" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-consolepolicy-3"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::211627567180:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Create*",
                          + "kms:Describe*",
                          + "kms:Enable*",
                          + "kms:List*",
                          + "kms:Put*",
                          + "kms:Update*",
                          + "kms:Revoke*",
                          + "kms:Disable*",
                          + "kms:Get*",
                          + "kms:Delete*",
                          + "kms:TagResource",
                          + "kms:UntagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::211627567180:user/grimoh"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access for Key Administrators"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::211627567180:role/GitHubActions_Terraform_main-tfaction_terraform_apply"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow use of the key"
                    },
                  + {
                      + Action    = [
                          + "kms:CreateGrant",
                          + "kms:ListGrants",
                          + "kms:RevokeGrant",
                        ]
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::211627567180:role/GitHubActions_Terraform_main-tfaction_terraform_apply"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow attachment of persistent resources"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":194,"Program":"tfcmt","SHA1":"da4cc872d027c422dacc2e5b80c11c1eb8c907bf","Target":"aws/main","Vars":{},"WorkflowName":"test"} -->